<template>
	1. 交換行列式的兩行列，因為只會使 $\det$ 的值變號，所以不影響非零乘積項的數目。<br>
	2. 令 $f(A)$ 為 $\det(A)$ 的非零乘積項個數。<br>
	3. 對 $A$ 的行列式的某一行列做降階，得到子矩陣 $A_1, \cdots\!, A_k$，則 $f(A) = f(A_1) + \cdots + f(A_k)$。<br>
	<br>
	將題目給的行列式的第 6 列透過列交換，移動至第 1 列：<br>
	$$
	f( \begin{bmatrix}
	* & 0 & * & * & 0 & * \\
	0 & 0 & * & * & 0 & * \\
	0 & * & * & * & * & 0 \\
	0 & * & * & 0 & * & 0 \\
	0 & * & * & * & * & 0 \\
	* & 0 & * & * & 0 & *
	\end{bmatrix} )
	= f( \begin{bmatrix}
	* & 0 & * & * & 0 & * \\
	* & 0 & * & * & 0 & * \\
	0 & 0 & * & * & 0 & * \\
	0 & * & * & * & * & 0 \\
	0 & * & * & 0 & * & 0 \\
	0 & * & * & * & * & 0
	\end{bmatrix} )
	$$
	嘗試對第 1 行降階，可以發現兩個子矩陣相同，因此等於 $2f(\cdot)$：
	$$
	f( \begin{bmatrix}
	\boxed{*} & 0 & * & * & 0 & * \\
	\boxed{*} & 0 & * & * & 0 & * \\
	0 & 0 & * & * & 0 & * \\
	0 & * & * & * & * & 0 \\
	0 & * & * & 0 & * & 0 \\
	0 & * & * & * & * & 0
	\end{bmatrix} )
	= 2f( \begin{bmatrix}
	0 & * & * & 0 & * \\
	0 & * & * & 0 & * \\
	* & * & * & * & 0 \\
	* & * & 0 & * & 0 \\
	* & * & * & * & 0
	\end{bmatrix} )
	$$
	嘗試對第 5 行降階，可以發現兩個子矩陣相同：
	$$
	2f( \begin{bmatrix}
	0 & * & * & 0 & \boxed{*} \\
	0 & * & * & 0 & \boxed{*} \\
	* & * & * & * & 0 \\
	* & * & 0 & * & 0 \\
	* & * & * & * & 0
	\end{bmatrix} )
	= 4f( \begin{bmatrix}
	0 & * & * & 0 \\
	* & * & * & * \\
	* & * & 0 & * \\
	* & * & * & *
	\end{bmatrix} )
	$$
	嘗試對第 1 列降階，然後第一個子矩陣又可降階為 2 階行列式：
	$$
	\begin{split}
	4f( \begin{bmatrix}
	0 & \boxed{*} & \boxed{*} & 0 \\
	* & * & * & * \\
	* & * & 0 & * \\
	* & * & * & *
	\end{bmatrix} )
	&= 4 [~ f( \begin{bmatrix} * & * & * \\ \boxed{*} & 0 & \boxed{*} \\ * & * & * \end{bmatrix} ) +
	f( \begin{bmatrix} * & * & * \\ * & * & * \\ * & * & * \end{bmatrix} ) ~] \\
	&= 4 [~ 2f( \begin{bmatrix} * & * \\ * & * \end{bmatrix} ) +
	f( \begin{bmatrix} * & * & * \\ * & * & * \\ * & * & * \end{bmatrix} ) ~]
	\end{split}
	$$
	4. 如果 $n$ 階行列式 $\det(A)$ 的所有元素都非零，那麼 $f(A) = n!$：
	$$= 4 (2 \cdot 2! + 3!) = \boxed{40}$$
</template>
