<template>
	<vk>
		設男醫生為 $a$、男護士為 $b$、女醫生為 $c$、女護士為 $d$，<br>
		題目給出的條件為：<br>
		(1) 醫院總共有 16 人：$a+b+c+d=16$<br>
		(2) 護士多於醫生：$b+d \gt a+c$<br>
		(3) 男醫生多於男護士：$a \gt b$<br>
		(4) 男護士多於女護士：$b \gt d$<br>
		(5) 至少有一位女醫生：$c \ge 1$<br>
		<br>
		開始推理：<br>
		(6) 根據 (1)(2)，護士必須多於一半，因此 $b+d \ge 9$。<br>
		(7) 根據 (1)(2)，醫生必須少於一半，因此 $7 \ge a+c$。<br>
		(8) 根據 (4)，$b-d \ge 1$。<br>
		(9) 將 (6)(8) 合併得到 $(b+d)+(b-d) \ge 9+1$，因此 $b \ge 5$。<br>
		(10) 根據 (3)(9)，$a \gt b \ge 5$，因此 $a \ge 6$。<br>
		(11) 將 (5)(10) 合併得到 $a+c \ge 7$。<br>
		(12) 根據 (7)(11)，$7 \ge a+c \ge 7$，因此 $a+c = 7$。<br>
		(13) 根據 (10)(12)，若 $a = 7$，則 $c = 0$ 與 (5) 矛盾，因此 $a = 6,~ c = 1$。<br>
		(14) 根據 (13)(3)(9)，$6 = a \gt b \ge 5$，因此 $b = 5$。<br>
		(15) 根據 (1)(13)(14)，$d = 4$。<br>
		<br>
		若說話的人是男醫生 $a$，排除不計會與 (3) 矛盾：$6-1 \gt 5$。<br>
		若說話的人是男護士 $b$，排除不計會與 (4) 矛盾：$5-1 \gt 4$。<br>
		若說話的人是女醫生 $c$，排除不計會與 (5) 矛盾：$1-1 \ge 1$。<br>
		所以說話的人是女護士。
	</vk>
</template>
